// Task 19. Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом:
// 14212 -> нет
// 12821 -> да
// 23432 -> да















// Task 21. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
// A (3,6,8); B (2,1,-7), -> 15.84
// A (7,-5, 0); B (1,-1,9) -> 11.53

















// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N:
// 3 -> 1, 8, 27
// 5 -> 1, 8, 27, 64, 125

/* void Cube(int number)
{
int current = 1;
if (number <= 0) Console.Write("Uncorrect data!");
while (current <= number)
    {
    Console.Write(Math.Pow(current, 3) + ", "); 
    current++;  
    } 
}     

Console.Write("Enter a positive number: ");
int num = Convert.ToInt32(Console.ReadLine());

Cube(num);
*/



